group-reports/shahriar-1-2-tests/results/disk-throughput-tuning-protocol-C/test-1.txt
read-sequentially-test-job: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
read-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

read-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=23874: Sun Jul  9 09:57:03 2023
   read: IOPS=5, BW=22.9MiB/s (24.0MB/s)(13.5GiB/602698msec)
    slat (usec): min=114, max=12094, avg=410.47, stdev=599.60
    clat (msec): min=57, max=5224, avg=2793.81, stdev=162.96
     lat (msec): min=60, max=5225, avg=2794.22, stdev=162.86
    clat percentiles (msec):
     |  1.00th=[ 2635],  5.00th=[ 2668], 10.00th=[ 2702], 20.00th=[ 2769],
     | 30.00th=[ 2769], 40.00th=[ 2802], 50.00th=[ 2802], 60.00th=[ 2802],
     | 70.00th=[ 2802], 80.00th=[ 2836], 90.00th=[ 2869], 95.00th=[ 2937],
     | 99.00th=[ 2937], 99.50th=[ 3004], 99.90th=[ 4665], 99.95th=[ 5067],
     | 99.99th=[ 5201]
   bw (  KiB/s): min= 8175, max=40715, per=99.84%, avg=23408.60, stdev=4522.02, samples=1201
   iops        : min=    1, max=    9, avg= 5.43, stdev= 1.20, samples=1201
  lat (msec)   : 100=0.03%, 250=0.03%, 500=0.03%, 750=0.06%, 1000=0.06%
  cpu          : usr=0.02%, sys=0.22%, ctx=3459, majf=0, minf=15885
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=99.6%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3450,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=22.9MiB/s (24.0MB/s), 22.9MiB/s-22.9MiB/s (24.0MB/s-24.0MB/s), io=13.5GiB (14.5GB), run=602698-602698msec

Disk stats (read/write):
    drbd1: ios=17898/6, merge=0/0, ticks=49679082/197, in_queue=49679279, util=100.00%, aggrios=17898/9, aggrmerge=0/0, aggrticks=49692928/142, aggrin_queue=49693070, aggrutil=100.00%
    dm-0: ios=17898/9, merge=0/0, ticks=49692928/142, in_queue=49693070, util=100.00%, aggrios=17682/9, aggrmerge=216/0, aggrticks=49092764/142, aggrin_queue=49084068, aggrutil=100.00%
  vdb: ios=17682/9, merge=216/0, ticks=49092764/142, in_queue=49084068, util=100.00%